Repository: ArseneSoulie/serena
Catalog: serena/Feature/Typist/Sources/Typist/Resources/Localizable.xcstrings
Source language: en
Languages: fr

source: Auto-submit
fr: Auto-validation

# Best combo: %lld • x%.1f
source: Best combo: %1$lld • x%2$.1f
fr: Meilleur combo: %1$lld • x%2$.1f

source: Best score
fr: Meilleur score

source: Easy words
fr: Mots faciles

source: Finished
fr: Fini

source: Full dictionary
fr: Dictionnaire complet

source: Get better at typing with a japanese keyboard !
fr: Deviens meilleur en écrivant avec un clavier japonais !

source: Handwriting keyboard
fr: Clavier Manuscrit

# HandwritingKeyboardExplanation
source: The handwriting keyboard uses a character recognition algorithm to suggest you the most relevant character(s) depending on the strokes you make It is handy to train writing by hand and remembering kana and kanji
fr: Le clavier écriture manuscrite utilise un algorithme de reconnaissance de caractères pour suggérer le ou les caractères les plus pertinents en fonction des traits que tu traces Il est pratique pour s'entraîner à écrire à la main et se souvenir des kana et des kanji

source: Input the falling text
fr: Entre le texte qui descend

# japaneseKeyboardMissingInstructions
source: To type in Japanese, add the Japanese keyboard in your device’s settings. This will give you Kana and Romaji (QWERTY) layouts that automatically convert romaji to kana and kanji. As well “Writing” which allows you to try writing characters by hand. `General > Keyboard > Keyboards > Add a keyboard > Japanese > Kana/Romaji/Writing`
fr: Pour taper en japonais, ajoute le clavier japonais dans les réglages de ton appareil. Ça te donnera les dispositions Kana et Romaji (QWERTY) qui convertissent automatiquement les romaji en kana et kanji. Ainsi que “Écriture” qui te permet de dessiner les symboles a la main `Général > Clavier > Claviers > Ajouter un clavier > Japonais > Kana/Romaji/Écriture`

# japaneseKeyboardMissingTitle
source: Japanese keyboard missing
fr: Clavier japonais manquant

# japaneseKeyboardReady
source: Japanese keyboard installed
fr: Clavier japonais installé

source: Kana only
fr: Kana uniquement

source: Kana keyboard
fr: Clavier Kana

# KanaKeyboardExplanation
source: The kana keyboard has multiple layouts. Its most common use is on a phone to be used in a T9 fashion. Each kana is grouped by consonant. Holding the key gives you access to the different variations. Neutral -> A Left -> I Up -> U Right -> E Down -> O
fr: Le clavier kana a plusieurs dispositions Son usage le plus courant se fait sur téléphone, à la manière du T9 Chaque kana est regroupé par consonne Maintenir la touche enfoncée donne accès aux différentes variations Neutre -> A Gauche -> I Haut -> U Droite -> E Bas -> O

source: Keyboard Setup
fr: Options du clavier

source: Keyboard types
fr: Types de claviers

source: New high score !
fr: Nouveau record !

source: Open settings
fr: Ouvrir les options

source: Pick a mode
fr: Choisis un mode

source: Play again
fr: Rejouer

source: Qwerty keyboard
fr: Clavier Qwerty

# QwertyKeyboardExplanation
source: The qwerty keyboard is used like a usual keyboard and has the same input methods you used while learning kana. The phonetic sounds are converted into kanji and kana suggestions. Doubling a consonant allows you to put a pause. This keyboard is well spread and mainly used for physical devices
fr: Le clavier qwerty s'utilise comme un clavier habituel et reprend les mêmes méthodes de saisie que celles que tu as utilisées lors de l'apprentissage des kana Les sons phonétiques sont ensuite convertis en suggestions de kanji et de kana Doubler une consonne permet d'insérer une pause Ce clavier est très répandu et principalement utilisé pour les appareils physiques

source: Total score
fr: Score total

source: Typing
fr: Écrire

source: Typing test
fr: Test d’écriture

# typingExplanation
source: Learn to write on a japanese keyboard or by hand Kana and Kanji. Write the falling words as fast as you can and get the best score !
fr: Apprends à écrire avec un clavier japonais ou à la main des Kana et Kanji Ecris les mots qui chutent le plus vite possible et obtiens le meilleur score !
